# InteriorTickDisplay Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..InteriorTickDisplay Property
ParameterTypeId Class See Also
---
"Interior Tick Mark Display"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId InteriorTickDisplay { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InteriorTickDisplay As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InteriorTickDisplay {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace